* Electronic wafermapping
** Automatic fill in collection plan
*** DONE Call with ati
    SCHEDULED: <2011-01-24 Mon>
**** Prepare
     CLOCK: [2011-01-24 Mon 09:34]--[2011-01-24 Mon 11:01] =>  1:27
***** mail sent at 14/09/2010
**** Organize regular follow up calls                                   :erp:
***** Weekly at 1:30pm on monday
**** Arrange week at Erfurt?
*** Tasks
**** Oracle
     SCHEDULED: <2011-02-07 Mon>
***** TODO Send message when a lot is finished               :shopfloor:intf:
***** TODO Fill in collection plan                           :shopfloor:intf:
**** Rtwm DB
***** TODO Send message when a wafermap is finished
      SCHEDULED: <2011-02-21 Mon>
**** Wafermapping
***** Erfurt
****** TODO Postprocessing
****** TODO TH01 convert
***** Sofia
****** TODO Postprocessing
****** TODO TH01 convert
***** Ieper
****** TODO Postprocessing
****** TODO TH01 convert
***** TODO Extract good number of dies
      SCHEDULED: <2011-02-14 Mon>
***** TODO Send good number of dies
      SCHEDULED: <2011-02-14 Mon>
***** TODO Start postprocessing
      SCHEDULED: <2011-02-14 Mon>
***** TODO Routing
      SCHEDULED: <2011-02-28 Mon>
***** TODO Exception handling
*** Questions
**** Will this system handle INK_TH01 in Erfurt
**** Add jem to the flow
**** Can postprocessing in Ieper also be executed on wafer base?
**** How will th01 convert know which file to convert?
*** Next actions
**** DONE Define interfaces for systems                                 :brh:
     :CLOCK:
     CLOCK: [2011-01-24 Mon 13:58]--[2011-01-24 Mon 14:10] =>  0:12
     CLOCK: [2011-01-24 Mon 11:04]--[2011-01-24 Mon 11:28] =>  0:24
     :END:
interfaces.org
**** DONE Create deployment diagram for electronic wafermapping
     CLOCK: [2011-01-24 Mon 14:11]--[2011-01-24 Mon 16:19] =>  2:08
**** TODO Interfaces from postprocessing                                :ati:
**** TODO Check shopfloor interface document
     :CLOCK:
     CLOCK: [2011-01-25 Tue 10:43]--[2011-01-25 Tue 10:44] =>  0:01
     CLOCK: [2011-01-25 Tue 09:14]--[2011-01-25 Tue 10:43] =>  1:29
     :END:
**** DONE INKLESS-433 Inkless not working for devices with 2 different itemnumbers
     SCHEDULED: <2011-02-03 Thu> DEADLINE: <2011-02-07 Mon>
     :CLOCK:
     CLOCK: [2011-01-27 Thu 13:23]--[2011-01-27 Thu 13:53] =>  0:30
     CLOCK: [2011-01-27 Thu 10:38]--[2011-01-27 Thu 12:14] =>  1:36
     CLOCK: [2011-01-27 Thu 10:14]--[2011-01-27 Thu 10:28] =>  0:14
     CLOCK: [2011-01-27 Thu 09:16]--[2011-01-27 Thu 10:03] =>  0:47
     CLOCK: [2011-01-26 Wed 09:05]--[2011-01-27 Thu 09:16] => 24:11
     CLOCK: [2011-01-25 Tue 10:45]--[2011-01-26 Wed 09:05] => 22:20
     :END:
     :PROPERTIES:
     :ORDERED:  t
     :END:
     Splitted in branch for refactoring and for this ticket.
***** TODO Add INKLESS-517 to this issue
**** TODO Create planning with dates for collection plan import
     SCHEDULED: <2011-01-31 Mon>
     :CLOCK:
     CLOCK: [2011-01-31 Mon 09:16]
     CLOCK: [2011-01-27 Thu 10:12]--[2011-01-27 Thu 10:13] =>  0:01
     CLOCK: [2011-01-27 Thu 10:12]--[2011-01-27 Thu 10:12] =>  0:00
     :END:
     :PROPERTIES:
     :ORDERED:  t
     :END:
**** TODO INKLESS-570 After change of subcontractor of an item,  the shopfloor interface does not pick up the new settings
     DEADLINE: <2011-02-03 Thu>
     CLOCK: [2011-01-27 Thu 14:01]--[2011-01-27 Thu 14:36] =>  0:35
***** Added partner to the list of fields to check.
***** TODO Verify in -test
** Inkless
*** Meetings
**** Inkless 19/01
**** partner 1.3.0
**** ready for uat
***** thursday or friday
**** DONE mirrored server for leister and xfab                    :todo:TODO:
     SCHEDULED: <2011-01-24 Mon> DEADLINE: <2011-01-26 Wed>
     CLOCK: [2011-01-27 Thu 10:28]--[2011-01-27 Thu 10:28] =>  0:00
Created ticket

**** partner 1.2.7
***** incident with carsem
**** p&t setup priority list for partner
***** DONE filter list for things that have already been done          :todo:
      SCHEDULED: <2011-01-24 Mon> DEADLINE: <2011-01-26 Wed>
      CLOCK: [2011-01-24 Mon 16:49]--[2011-01-24 Mon 17:16] =>  0:27
      :PROPERTIES:
      :ORDERED:  t
      :END:
**** update release number on partner-ui
**** inkless littered with incidents
**** deployment diagram for inkless and partner                     :ARCHIVE:
**** Inkless 26/01
***** partner 1.3.0
****** DONE create package for partner 1.3.0
       SCHEDULED: <2011-01-27 Thu>
       CLOCK: [2011-01-27 Thu 10:03]--[2011-01-27 Thu 10:09] =>  0:06
***** partner 1.2.7
****** wafermaps didn't arrive at carsem 1
******* explained how we got a timeout when confirming wafermaps

**** Inkless 27/01
***** TODO Rotate wafermaps after downloading them in Inkless. :rotate:issue:PRTNR:4:
***** TODO Add possibility configure a wafermap to be rotated. :rotate:issue:PRTNR:4:
***** TODO Ask Peter to know more about Pactech and Continental

*** Auto fill in collection plans
*** Sent mail to ati                                         :mail:follow:up:
*** DONE Create planning for project                                    :ati:
    DEADLINE: <2011-01-25 Tue>

** Partner
*** DONE Create package for partner 1.3.0
    SCHEDULED: <2011-01-25 Tue>



